IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_erad_global_regs.xml
<module id="ERAD_GLOBAL_REGS" HW_revision="" description="ERAD GLOBAL Registers">
	<register id="GLBL_EVENT_STAT" width="16" page="1" offset="0x0" internal="0" description="Global Event Status Register">
		<bitfield id="HWBP1" description="Bus Comparator Module Event Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="HWBP2" description="Bus Comparator Module Event Status" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="HWBP3" description="Bus Comparator Module Event Status" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="HWBP4" description="Bus Comparator Module Event Status" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="HWBP5" description="Bus Comparator Module Event Status" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="HWBP6" description="Bus Comparator Module Event Status" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="HWBP7" description="Bus Comparator Module Event Status" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="HWBP8" description="Bus Comparator Module Event Status" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="CTM1" description="Counter Module Event Status" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="CTM2" description="Counter Module Event Status" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="CTM3" description="Counter Module Event Status" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="CTM4" description="Counter Module Event Status" begin="11" end="11" width="1" rwaccess="R"/>
	</register>
	<register id="GLBL_HALT_STAT" width="16" page="1" offset="0x2" internal="0" description="Global Halt Status Register">
		<bitfield id="HWBP1" description="Bus Comparator Module Halt Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="HWBP2" description="Bus Comparator Module Halt Status" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="HWBP3" description="Bus Comparator Module Halt Status" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="HWBP4" description="Bus Comparator Module Halt Status" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="HWBP5" description="Bus Comparator Module Halt Status" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="HWBP6" description="Bus Comparator Module Halt Status" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="HWBP7" description="Bus Comparator Module Halt Status" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="HWBP8" description="Bus Comparator Module Halt Status" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="CTM1" description="Counter Module Halt Status" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="CTM2" description="Counter Module Halt Status" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="CTM3" description="Counter Module Halt Status" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="CTM4" description="Counter Module Halt Status" begin="11" end="11" width="1" rwaccess="R"/>
	</register>
	<register id="GLBL_ENABLE" width="16" page="1" offset="0x4" internal="0" description="Global Enable Register">
		<bitfield id="HWBP1" description="Bus Comparator Module Global Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="HWBP2" description="Bus Comparator Module Global Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="HWBP3" description="Bus Comparator Module Global Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="HWBP4" description="Bus Comparator Module Global Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="HWBP5" description="Bus Comparator Module Global Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="HWBP6" description="Bus Comparator Module Global Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="HWBP7" description="Bus Comparator Module Global Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="HWBP8" description="Bus Comparator Module Global Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CTM1" description="Counter Module Global Enable" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CTM2" description="Counter Module Global Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CTM3" description="Counter Module Global Enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CTM4" description="Counter Module Global Enable" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="GLBL_CTM_RESET" width="16" page="1" offset="0x6" internal="0" description="Global Counter Reset">
		<bitfield id="CTM1" description="Global Reset for the counters" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CTM2" description="Global Reset for the counters" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CTM3" description="Global Reset for the counters" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CTM4" description="Global Reset for the counters" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="GLBL_OWNER" width="16" page="1" offset="0xa" internal="0" description="Global Ownership">
		<bitfield id="OWNER" description="Global Ownership Bits" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
</module>
